# Brewfile - managed by `brew bundle`
# Install: brew bundle --file=~/.dotfiles/Brewfile
# Export current: brew bundle dump --file=~/.dotfiles/Brewfile --force

# Taps
tap "homebrew/cask-fonts"
tap "universal-ctags/universal-ctags"

# Core utilities
brew "coreutils"
brew "findutils"
brew "stow"

# Shell
brew "zsh"
brew "bash"

# Editor
brew "neovim"
brew "vim"

# Terminal multiplexer
brew "tmux"
brew "reattach-to-user-namespace"

# Git
brew "git"
brew "tig"
brew "ghq"

# Search & Navigation
brew "fzf"
brew "ripgrep"
brew "tree"

# Tags
brew "universal-ctags"

# Utils
brew "colordiff"
brew "direnv"
brew "wget"
brew "curl"
brew "nkf"
brew "jq"

# Languages & Version managers
brew "pyenv"
brew "nvm"
brew "go"

# Fonts
cask "font-fira-code"
cask "font-moralerspace-nf"
cask "font-source-code-pro"

# GUI Apps
cask "ghostty"
cask "visual-studio-code"
